a = '''สถาปัตยกรรม
基礎板材構築建設架家屋敷棟軒門垣塀堀邸宅亭荘堂舎館院楼閣城塁倉庫蔵橋堤塔碑
ไฟ-น้ำ
火炎煙燃薪炭灰灯窯焦水液波浪潮泡渦注流漏滴漂浮沈没潜浸潤洪濫氷凍湯沸洗濯浴
อุปกรณ์-เครื่องมือ
品物具器機械皿盤杯鉢陶漆缶瓶栓針筆扇傘柄棒机卓袋箱槽棺旗幕網羅綱縄鎖錠鈴鐘鏡
สี-แสง-เสียง-กลิ่น
色彩白赤紅丹朱黄緑青紺紫褐黒玄墨鮮塗明暗陰影光輝照映音響拍声芳香臭薫
มือ
持把握採取拾捨掲揚挙提携振揺投打操扱払挟摘抜折搾挿刺突押引締巻開閉割裂切刻
ตา-หู-ปาก
見視看観察覧眺聞聴含吹呼叫喚号言話語談論説述陳宣弁読伝報告問尋答応黙
ร่างกาย
動座起立歩走奔駆止停屈伸跳躍踊踏転倒伏接触抱擁支担放置措据掛懸乗泳掘埋
การเคลื่อนที่
出入発行往赴訪寄追迫過来帰返戻還移遷回巡循旋従伴随率登昇降至到達越退去別岐
การกระทำ
為践施揮創作造済了卒完遂貫徹受享隠匿捜探索遮封込括却棄撤整備補添張継矯謄待控
ความรู้สึก
喜悦歓楽愉快朗恋慕情好嫌泣笑哀悲嘆慨寂憂愁惜懐悔恨憾憎忌怒憤恐怖驚慌誇
จิตใจ
安泰穏妥寧寛悠懇慰魅希望求欲志願頑奮緊虞怪疑悩惑迷妄秘忍耐堪困苦恥辱侮慢慣
ครอบครัว-ชีวิต
親子孫父母兄弟姉妹伯叔嫡嗣婿嫁婚姻夫妻生誕命籍児童幼稚若老翁婆死逝涯墓
ความสัมพันธ์
自己我私僕君彼某他友互仲媒介紹助佐援協請託依頼渉譲与貸借遭遇招迎扶養育殉遺悼
โครงสร้างกลุ่ม
人性男女郎婦娘嬢者各共皆姓名氏族民系類属班組集団群衆会徒僚輩閥般募孤独
การต่อสู้-แข่งขัน
挑競争闘謀侵妨阻抵抗拒断排斥抑圧禁守護衛防勝負敗逃避詰謝許
คำสุภาพ-พิธีการ
御殿召賜貢献奉呈仰臨謁伺参申啓承致尊敬謙恭謹粛慎儀式宴催披贈誓慶祝賀寿弔葬
สถานะ-รางวัล
位格級皇帝王陛朕詔勅璽后妃姫公侯爵臣奴隷紳淑主客賓貴雅卑勲功賞褒賛称誉彰
เวลา-ปฏิทิน
秒分時日月年曜週旬期世紀昭歳齢暁朝昼午夕宵晩夜暮昨今翌瞬暫永恒久新旧古昔暦
ตัวเลข-ปริมาณ
一二三四五六七八九十零壱弐百千万億兆半単複双両対倍幾数算量衡測計唯等
หน่วย-ลำดับ
寸尺丈勺升斗俵斤匁厘畝坪度匹隻枚束箇個員第番段順序逆逐甲乙丙丁初次準副亜
ตำแหน่ง-ทิศทาง
上下左右前後表裏内外中央間奥底先末端縁隅角側傍隣縦横経緯東西南北方向
ขอบเขต-เรื่องราว
圏層域郭郊場所席跡頂枠幅界境際周囲包沿畔辺距隔離限偏事項件例原源故由因拠何
การเมือง
政治権執枢宰司統領委任嘱議諮策准盟制定憲法律令規則範条款頒党派
การปกครอง-กฎหมาย
国邦都県郡市区町村郷里街府庁署局部課轄監督遣官吏役罷迭秩遵訴訟廷陪審証劾糾
เศรษฐกิจ-การเงิน
貨幣銭札券票価値需要供給購買販売資商料利損益契債騰廉費倹預貯蓄賦租税財宝帳簿
อุตสาหกรรม-แรงงาน
農漁工電獲穫収田畑拓墾耕苗栽培刈伐牧酪企業営製促使雇用就職労働稼勤務仕俸酬賃
การขนส่ง
貿店舗卸荷搭載便運輸搬送配届納交通渡航駅港津径道路程途軌騎汽車輪舟船舶帆郵逓
การแพทย์
医療癒診剖疾病疫症痢痘患篤菌毒冒脹痛傷薬剤効健康保滋壮肥妊娠産疲癖痴狂盲
การศึกษา
才能遊戯模倣訓練習学知識解理修究勉努励科試験技術教授諭講導師匠塾校
อาชญากรรม
犯罪殴撲暴襲破壊奪窃盗拐嚇脅喝詐欺唆賄虐殺害賊警逮捕拘処罰刑獄囚懲赦免賠償
การทหาร
弓矢刀刃剣矛盾銃砲弾射撃衝爆艦艇軍隊陣屯偵攻戦討征鎮覇侍武士帥将尉曹兵敵虜拷
ศิลปะ
字句詞辞文章抄旨題俳詩韻詠描写書記録叙銘著翻訳釈稿刷版刊訂本冊典鑑誌紙
งานอดิเรก-ประวัติศาสตร์
娯趣棋碁釣旅芸舞謡吟唱歌弦琴鼓笛奏譜絵画図肖塑像彫演劇撮歴史欧漢呉唐京藩塚墳
ศาสนา
宗崇拝祈念祭祖霊魂浄犠牲仏禅寺僧坊尚尼盆神宮社占吉凶祥幸福祉禍厄災障弊鬼魔仙
ศีลธรรม
儒倫哲聖徳仁義礼忠孝恩信誠真偽正邪善悪心衷愛慈恵救和貞朴勇克悟怠惰省顧戒責
ร่างกาย 1
身体皮膚肌毛髪頭面顔額目眼耳鼻口唇歯舌首肩胸腹背胴腰肢腕手掌指脚足
ร่างกาย 2
脳骨髄血脈筋肉力臓肺肝胆胎胃腸脂肪胞膜息吸吐汗涙尿泌
สัตว์
畜獣鳥魚昆虫貝犬猫豚鶏牛馬羊猿蛇蚊蛍鯨竜蚕繭殻核卵乳羽翼尾鳴飛雌雄巣殖飼狩猟
พืช
草花藻木樹根株茎幹節枝葉芽穂果実種豆菜芋稲麦芝菊松竹梅桃桜杉柳桑植茂咲散枯朽
ดาราศาสตร์-อุตุนิยมวิทยา
宇宙天空陽星季春夏秋冬気候暑暖温寒涼晴曇雨風雲雪霜霧雰露雷湿干乾燥震噴
ภูมิศาสตร์
山峰岳丘陵峠坂野林森洞陸海洋湾浦江沖浜岸潟礁島州岬崎湖沼沢池泉瀬滝河川渓谷峡
แร่ธาตุ-การปรับปรุง
土地壌泥砂石岩金銀銅鉄鉛硝硫窒元素晶油磁鉱炉溶鋳鍛錬削砕研擦摩磨抽析銑鋼
รูปร่าง-รูปทรง
点線直垂斜曲弧円丸球珠玉軸管筒環孔穴坑凹凸平列塊片粉粒抹印徴標符形型象相容姿
ระดับ 1
大小巨微多少寡太細長短重軽厚薄濃淡高低深浅遠近広狭熱冷早速迅遅強弱急緩精詳頻
ระดับ 2
固堅硬剛柔軟滑粗荒粘疎密汚濁澄透鋭鈍難易簡激烈猛豪威厳酷惨貧窮乏豊富裕極甚最
สภาพ 1
状況閑静幽騒忙煩雑冗漫漠凡庸俗蛮危険落堕墜陥紛混錯絡累積駐留滞続連並併合付附
สภาพ 2
全総充満尽残余剰適宜概約略徐漸常毎専敢必再偶未猶予即既諸庶擬似如的斉均
การมีตัวตน-การรับรู้
存在有無虚夢幻普遍質様態景勢顕現消失喪逸欠滅亡絶廃得意思想憶考慮案感勘覚忘
การเปลี่ยนแปลง
増減加除始終代替換変化復改更成興隆盛繁栄膨熟展延拡及超縮傾覆乱衰崩耗腐融凝
การประเมิน-ความสัมพันธ์
賢愚巧拙駄優秀良劣英俊傑敏博偉純粋清潔美醜佳麗華妙奇珍特殊批評関係兼以但又且
การตัดสิน
異違同差比較選択調検査閲認諾肯決判確誤該当示誘勧進推薦奨不非反否是可然仮'''

aa = a.split('\n')
Idx,endIdx = 0,len(aa)-2
while(Idx != endIdx):
    print(aa[Idx]+'\n'+aa[Idx+1])
    Idx += 2